In [ ]:
#Entropy - this is disorder in the data. If the sample is equally mixed, 50:50 event:non-event the the entropy is 1.
#Entropy lies from 0 to 1. 0 is better.

#Information gain - post split the reduction in entropy(combined entropy accounts for both side split)
#compared to parent node entropy is information gained.

#Gini impurity - if the data is 50:50 then it is 100% impure. Lies from 0 to 0.5. 
# 0 is best. Mostly Gini impurity is used as split criterion
 
#A feature split is considered for differnt threshold / category groupings. 
#Based on split criterion the best value of the feature is used for splitting the node

#A split can be based on Gini / entropy / Information gain 

#depth of the tree, minimum sample in each node, no of leaf nodes are hyperparameters

#missing treatmnet and feature scaling not required

#Classification And Regression Tree (CART) is only binary split. Y can be binary/multiclass/continuous.
#Majority class or aveage value in case of continuous variable (Regresssion) is the predicted Y

#Chi-Square Automatic Intercation Detector (CHAID) can have multiple splits. Y can be binary/multiclass/continuous. 
#If Y is continuous then grouped/binned. X must be categorical only. Multiple splits allowed

In [4]:
import pandas as pd

df = pd.read_csv('Salaries.csv')

print (df)

print ('shape',df.shape)

       company                  job     degree  salary_more_then_100k
0       google      sales executive  bachelors                      0
1       google      sales executive    masters                      0
2       google     business manager  bachelors                      1
3       google     business manager    masters                      1
4       google  computer programmer  bachelors                      0
5       google  computer programmer    masters                      1
6   abc pharma      sales executive    masters                      0
7   abc pharma  computer programmer  bachelors                      0
8   abc pharma     business manager  bachelors                      0
9   abc pharma     business manager    masters                      1
10    facebook      sales executive  bachelors                      1
11    facebook      sales executive    masters                      1
12    facebook     business manager  bachelors                      1
13    facebook     business manager    masters                      1
14    facebook  computer programmer  bachelors                      1
15    facebook  computer programmer    masters                      1
shape (16, 4)

In [13]:
#set independent & target col
inputs = df.drop('salary_more_then_100k', axis=1)
target = df['salary_more_then_100k']

inputs.head()

  company                  job     degree
0  google      sales executive  bachelors
1  google      sales executive    masters
2  google     business manager  bachelors
3  google     business manager    masters
4  google  computer programmer  bachelors

In [16]:
#view target
target.head()

0    0
1    0
2    1
3    1
4    0
Name: salary_more_then_100k, dtype: int64

In [19]:
#to convert text to numbers

from sklearn.preprocessing import LabelEncoder
le_company = LabelEncoder()
le_job = LabelEncoder()
le_degree = LabelEncoder()

inputs['company_n'] = le_company.fit_transform(inputs['company'])
inputs['job_n'] = le_company.fit_transform(inputs['job'])
inputs['degree_n'] = le_company.fit_transform(inputs['degree'])

inputs.head(5)

  company                  job     degree  company_n  job_n  degree_n
0  google      sales executive  bachelors          2      2         0
1  google      sales executive    masters          2      2         1
2  google     business manager  bachelors          2      0         0
3  google     business manager    masters          2      0         1
4  google  computer programmer  bachelors          2      1         0

In [20]:
#drop unwanted col

inputs_n = inputs.drop(['company', 'job', 'degree'], axis=1)
inputs_n

    company_n  job_n  degree_n
0           2      2         0
1           2      2         1
2           2      0         0
3           2      0         1
4           2      1         0
5           2      1         1
6           0      2         1
7           0      1         0
8           0      0         0
9           0      0         1
10          1      2         0
11          1      2         1
12          1      0         0
13          1      0         1
14          1      1         0
15          1      1         1

In [23]:
#fit model
from sklearn import tree
model = tree.DecisionTreeClassifier()

#uses gini criterion
model.fit(inputs_n, target)

DecisionTreeClassifier()

In [24]:
#compute accuarcy: correct_predictions/total no of obs
model.score(inputs_n,target)

1.0

In [26]:
#predict
model.predict([[2,0,1]])

#predicts 1, salary >100K

array([1], dtype=int64)